---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarManyLoops
source: html/41aaefaa-7920-9f58-df20-b2242fe403ac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarManyLoops Property

Rebar Sketch contains more than one loop. Can't create Rebar.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarManyLoops { get; }
```